bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA256RFR2.xml
            <value-group caption="" name="COMM_STOP_BIT_SEL">
                <value caption="1-bit" name="VAL_0x00" value="0x00"/>
                <value caption="2-bit" name="VAL_0x01" value="0x01"/>
            </value-group>
            <value-group caption="" name="USART_CHAR_SIZE_BITF">
                <value caption="5-bit" name="VAL_0" value="0"/>
                <value caption="6-bit" name="VAL_1" value="1"/>
                <value caption="7-bit" name="VAL_2" value="2"/>
                <value caption="8-bit" name="VAL_3" value="3"/>
                <value caption="Reserved" name="VAL_4" value="4"/>
                <value caption="Reserved" name="VAL_5" value="5"/>
                <value caption="Reserved" name="VAL_6" value="6"/>
                <value caption="9-bit" name="VAL_7" value="7"/>
            </value-group>
            <value-group caption="" name="USART_CLK_POLARITY_BITF">
                <value caption="Rising XCKn Edge (Transmitted Data Changed), Falling XCKn Edge (Received Data Sampled)"
                       name="VAL_0" value="0"/>
                <value caption="Falling XCKn Edge (Transmitted Data Changed), Rising XCKn Edge (Received Data Sampled)"
                       name="VAL_1" value="1"/>
            </value-group>
        </module>
        <module caption="Two Wire Serial Interface" name="TWI">
            <register-group caption="Two Wire Serial Interface" name="TWI">
                <register caption="TWI (Slave) Address Mask Register" name="TWAMR" offset="0xBD" size="1">
                    <bitfield caption="TWI Address Mask" mask="0xFE" name="TWAM"/>
                    <bitfield caption="Reserved Bit" mask="0x01" name="Res"/>
                </register>
                <register caption="TWI Bit Rate Register" name="TWBR" offset="0xB8" size="1" mask="0xFF"/>
                <register caption="TWI Control Register" name="TWCR" offset="0xBC" size="1" ocd-rw="R">
                    <bitfield caption="TWI Interrupt Flag" mask="0x80" name="TWINT"/>
                    <bitfield caption="TWI Enable Acknowledge Bit" mask="0x40" name="TWEA"/>
                    <bitfield caption="TWI START Condition Bit" mask="0x20" name="TWSTA"/>
                    <bitfield caption="TWI STOP Condition Bit" mask="0x10" name="TWSTO"/>
                    <bitfield caption="TWI Write Collision Flag" mask="0x08" name="TWWC"/>
                    <bitfield caption="TWI Enable Bit" mask="0x04" name="TWEN"/>
                    <bitfield caption="Reserved Bit" mask="0x02" name="Res"/>
                    <bitfield caption="TWI Interrupt Enable" mask="0x01" name="TWIE"/>
                </register>
                <register caption="TWI Status Register" name="TWSR" offset="0xB9" size="1">
                    <bitfield caption="TWI Status" mask="0xF8" name="TWS" values="TWI_STATUS_BITF" lsb="3"/>
                    <bitfield caption="Reserved Bit" mask="0x04" name="Res"/>
                    <bitfield caption="TWI Prescaler Bits" mask="0x03" name="TWPS" values="COMM_TWI_PRESACLE"/>
                </register>
                <register caption="TWI Data Register" name="TWDR" offset="0xBB" size="1" mask="0xFF"/>
                <register caption="TWI (Slave) Address Register" name="TWAR" offset="0xBA" size="1">
                    <bitfield caption="TWI (Slave) Address" mask="0xFE" name="TWA"/>
                    <bitfield caption="TWI General Call Recognition Enable Bit" mask="0x01" name="TWGCE"/>
                </register>
            </register-group>
            <value-group caption="" name="TWI_STATUS_BITF">
                <value caption="Bus error due to illegal START or STOP condition." name="VAL_0x00" value="0x00"/>
                <value caption="A START condition has been transmitted." name="VAL_0x08" value="0x08"/>
                <value caption="A repeated START condition has been transmitted." name="VAL_0x10" value="0x10"/>
                <value caption="SLA+W has been transmitted; ACK has been received." name="VAL_0x18" value="0x18"/>
                <value caption="SLA+W has been transmitted; NOT ACK has been received." name="VAL_0x20" value="0x20"/>
                <value caption="Data byte has been transmitted; ACK has been received." name="VAL_0x28" value="0x28"/>
                <value caption="Data byte has been transmitted; NOT ACK has been received." name="VAL_0x30"
                       value="0x30"/>
                <value caption="Arbitration lost in SLA+W or data bytes (Transmitter); Arbitration lost in SLA+R or NOT ACK bit (Receiver)."
                       name="VAL_0x38" value="0x38"/>
                <value caption="SLA+R has been transmitted; ACK has been received." name="VAL_0x40" value="0x40"/>
                <value caption="SLA+R has been transmitted; NOT ACK has been received." name="VAL_0x48" value="0x48"/>
                <value caption="Data byte has been received; ACK has been returned." name="VAL_0x50" value="0x50"/>
                <value caption="Data byte has been received; NOT ACK has been returned." name="VAL_0x58" value="0x58"/>
                <value caption="Own SLA+W has been received; ACK has been returned." name="VAL_0x60" value="0x60"/>
                <value caption="Arbitration lost in SLA+R/W as Master; own SLA+W has been received; ACK has been returned."
                       name="VAL_0x68" value="0x68"/>
                <value caption="General call address has been received; ACK has been returned." name="VAL_0x70"
                       value="0x70"/>
                <value caption="Arbitration lost in SLA+R/W as Master; general call address has been received; ACK has been returned."
                       name="VAL_0x78" value="0x78"/>
                <value caption="Previously addressed with own SLA+W; data has been received; ACK has been returned."
                       name="VAL_0x80" value="0x80"/>
                <value caption="Previously addressed with own SLA+W; data has been received; NOT ACK has been returned."
                       name="VAL_0x88" value="0x88"/>
                <value caption="Previously addressed with general call; data has been received; ACK has been returned."
                       name="VAL_0x90" value="0x90"/>
                <value caption="Previously addressed with general call; data has been received; NOT ACK has been returned."
                       name="VAL_0x98" value="0x98"/>
                <value caption="A STOP condition or repeated START condition has been received while still addressed as Slave."
                       name="VAL_0xA0" value="0xA0"/>
                <value caption="Own SLA+R has been received; ACK has been returned." name="VAL_0xA8" value="0xA8"/>
                <value caption="Arbitration lost in SLA+R/W as Master; own SLA+R has been received; ACK has been returned."
                       name="VAL_0xB0" value="0xB0"/>
                <value caption="Data byte in TWDR has been transmitted; ACK has been received." name="VAL_0xB8"
                       value="0xB8"/>
                <value caption="Data byte in TWDR has been transmitted; NO ACK has been received." name="VAL_0xC0"
                       value="0xC0"/>
                <value caption="Last data byte in TWDR has been transmitted (TWEA = 0); ACK has been received."
                       name="VAL_0xC8" value="0xC8"/>
                <value caption="No relevant state information available; TWINT = 0." name="VAL_0xF8" value="0xF8"/>
            </value-group>
            <value-group caption="" name="COMM_TWI_PRESACLE">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="4" name="VAL_0x01" value="0x01"/>
                <value caption="16" name="VAL_0x02" value="0x02"/>
                <value caption="64" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
