bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA256RFR2.xml
                <register caption="Timer/Counter1  Bytes" name="TCNT1" offset="0x84" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register A  Bytes" name="OCR1A" offset="0x88" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register B  Bytes" name="OCR1B" offset="0x8A" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register C  Bytes" name="OCR1C" offset="0x8C" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter1 Input Capture Register  Bytes" name="ICR1" offset="0x86" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter1 Interrupt Mask Register" name="TIMSK1" offset="0x6F" size="1">
                    <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x20" name="ICIE1"/>
                    <bitfield caption="Timer/Counter1 Output Compare C Match Interrupt Enable" mask="0x08"
                              name="OCIE1C"/>
                    <bitfield caption="Timer/Counter1 Output Compare B Match Interrupt Enable" mask="0x04"
                              name="OCIE1B"/>
                    <bitfield caption="Timer/Counter1 Output Compare A Match Interrupt Enable" mask="0x02"
                              name="OCIE1A"/>
                    <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x01" name="TOIE1"/>
                </register>
                <register caption="Timer/Counter1 Interrupt Flag Register" name="TIFR1" offset="0x36" size="1"
                          ocd-rw="R">
                    <bitfield caption="Timer/Counter1 Input Capture Flag" mask="0x20" name="ICF1"/>
                    <bitfield caption="Timer/Counter1 Output Compare C Match Flag" mask="0x08" name="OCF1C"/>
                    <bitfield caption="Timer/Counter1 Output Compare B Match Flag" mask="0x04" name="OCF1B"/>
                    <bitfield caption="Timer/Counter1 Output Compare A Match Flag" mask="0x02" name="OCF1A"/>
                    <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
                </register>
            </register-group>
            <value-group caption="" name="TC4_COMNX_BITF">
                <value caption="Normal operation" name="VAL_0" value="0"/>
                <value caption="Reserved" name="VAL_1" value="1"/>
                <value caption="Reserved" name="VAL_2" value="2"/>
                <value caption="Reserved" name="VAL_3" value="3"/>
            </value-group>
            <value-group caption="" name="TC1_WGMX_BITF">
                <value caption="Normal mode of operation" name="VAL_0x0" value="0x0"/>
                <value caption="PWM, phase correct, 8-bit" name="VAL_0x1" value="0x1"/>
                <value caption="PWM, phase correct, 9-bit" name="VAL_0x2" value="0x2"/>
                <value caption="PWM, phase correct, 10-bit" name="VAL_0x3" value="0x3"/>
                <value caption="CTC, TOP = OCRnA" name="VAL_0x4" value="0x4"/>
                <value caption="Fast PWM, 8-bit" name="VAL_0x5" value="0x5"/>
                <value caption="Fast PWM, 9-bit" name="VAL_0x6" value="0x6"/>
                <value caption="Fast PWM, 10-bit" name="VAL_0x7" value="0x7"/>
                <value caption="PWM, Phase and frequency correct, TOP = ICRn" name="VAL_0x8" value="0x8"/>
                <value caption="PWM, Phase and frequency correct, TOP = OCRnA" name="VAL_0x9" value="0x9"/>
                <value caption="PWM, Phase correct, TOP = ICRn" name="VAL_0xA" value="0xA"/>
                <value caption="PWM, Phase correct, TOP = OCRnA" name="VAL_0xB" value="0xB"/>
                <value caption="CTC, TOP = OCRnA" name="VAL_0xC" value="0xC"/>
                <value caption="Reserved" name="VAL_0xD" value="0xD"/>
                <value caption="Fast PWM, TOP = ICRn" name="VAL_0xE" value="0xE"/>
                <value caption="Fast PWM, TOP = OCRnA" name="VAL_0xF" value="0xF"/>
            </value-group>
            <value-group caption="" name="CLK_SEL_3BIT_NOEXT_MEGARF">
                <value caption="No clock source (Timer/Counter stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="clk_IO/1 (no prescaling)" name="VAL_0x01" value="0x01"/>
                <value caption="clk_IO/8 (from prescaler)" name="VAL_0x02" value="0x02"/>
                <value caption="clk_IO/64 (from prescaler)" name="VAL_0x03" value="0x03"/>
                <value caption="clk_IO/256 (from prescaler)" name="VAL_0x04" value="0x04"/>
                <value caption="clk_IO/1024 (from prescaler)" name="VAL_0x05" value="0x05"/>
                <value caption="Reserved" name="VAL_0x06" value="0x06"/>
                <value caption="Reserved" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="TC1_COMNX_BITF">
                <value caption="Normal port operation, OCnA/OCnB/OCnC disconnected." name="VAL_0" value="0"/>
                <value caption="Toggle OCnA/OCnB/OCnC on Compare Match." name="VAL_1" value="1"/>
                <value caption="Clear OCnA/OCnB/OCnC on Compare Match (set output to low level)." name="VAL_2"
                       value="2"/>
                <value caption="Set OCnA/OCnB/OCnC on Compare Match (set output to high level)." name="VAL_3"
                       value="3"/>
            </value-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT_MEGARF">
                <value caption="No clock source (Timer/Counter stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="clk_IO/1 (no prescaling)" name="VAL_0x01" value="0x01"/>
                <value caption="clk_IO/8 (from prescaler)" name="VAL_0x02" value="0x02"/>
                <value caption="clk_IO/64 (from prescaler)" name="VAL_0x03" value="0x03"/>
                <value caption="clk_IO/256 (from prescaler)" name="VAL_0x04" value="0x04"/>
                <value caption="clk_IO/1024 (from prescaler)" name="VAL_0x05" value="0x05"/>
                <value caption="External clock source on Tn pin, clock on falling edge" name="VAL_0x06" value="0x06"/>
                <value caption="External clock source on Tn pin, clock on rising edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Low-Power 2.4 GHz Transceiver" name="TRX24">
            <register-group caption="Low-Power 2.4 GHz Transceiver" name="TRX24">
                <register caption="Power Amplifier Ramp up/down Control Register" name="PARCR" offset="0x138" size="1">
                    <bitfield caption="ext. PA Ramp Down Lead Time" mask="0xE0" name="PALTD" values="PALTD_bitf"/>
                    <bitfield caption="ext. PA Ramp Up Lead Time" mask="0x1C" name="PALTU" values="PALTU_bitf"/>
                    <bitfield caption="Power Amplifier Ramp Down Frequency Inversion" mask="0x02" name="PARDFI"/>
                    <bitfield caption="Power Amplifier Ramp Up Frequency Inversion" mask="0x01" name="PARUFI"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 0 (Low Byte)" name="MAFSA0L"
                          offset="0x10E" size="1">
                    <bitfield caption="MAC Short Address low Byte for Frame Filter 0" mask="0xFF" name="MAFSA0L"/>
                </register>
