bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA256RFR2.xml
                <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x4A" size="1">
                    <bitfield caption="General Purpose I/O Register 1 Value" mask="0xFF" name="GPIOR" lsb="10"/>
                </register>
                <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x3E" size="1">
                    <bitfield caption="General Purpose I/O Register 0 Value" mask="0x80" name="GPIOR07"/>
                    <bitfield caption="General Purpose I/O Register 0 Value" mask="0x40" name="GPIOR06"/>
                    <bitfield caption="General Purpose I/O Register 0 Value" mask="0x20" name="GPIOR05"/>
                    <bitfield caption="General Purpose I/O Register 0 Value" mask="0x10" name="GPIOR04"/>
                    <bitfield caption="General Purpose I/O Register 0 Value" mask="0x08" name="GPIOR03"/>
                    <bitfield caption="General Purpose I/O Register 0 Value" mask="0x04" name="GPIOR02"/>
                    <bitfield caption="General Purpose I/O Register 0 Value" mask="0x02" name="GPIOR01"/>
                    <bitfield caption="General Purpose I/O Register 0 Value" mask="0x01" name="GPIOR00"/>
                </register>
                <register caption="Power Reduction Register 2" name="PRR2" offset="0x63" size="1">
                    <bitfield caption="Power Reduction SRAM3" mask="0x08" name="PRRAM3"/>
                    <bitfield caption="Power Reduction SRAM2" mask="0x04" name="PRRAM2"/>
                    <bitfield caption="Power Reduction SRAM1" mask="0x02" name="PRRAM1"/>
                    <bitfield caption="Power Reduction SRAM0" mask="0x01" name="PRRAM0"/>
                </register>
                <register caption="Power Reduction Register 1" name="PRR1" offset="0x65" size="1">
                    <bitfield caption="Reserved Bit" mask="0x80" name="Res"/>
                    <bitfield caption="Power Reduction Transceiver" mask="0x40" name="PRTRX24"/>
                    <bitfield caption="Power Reduction Timer/Counter5" mask="0x20" name="PRTIM5"/>
                    <bitfield caption="Power Reduction Timer/Counter4" mask="0x10" name="PRTIM4"/>
                    <bitfield caption="Power Reduction Timer/Counter3" mask="0x08" name="PRTIM3"/>
                    <bitfield caption="Power Reduction USART1" mask="0x01" name="PRUSART1"/>
                </register>
                <register caption="Power Reduction Register0" name="PRR0" offset="0x64" size="1">
                    <bitfield caption="Power Reduction TWI" mask="0x80" name="PRTWI"/>
                    <bitfield caption="Power Reduction Timer/Counter2" mask="0x40" name="PRTIM2"/>
                    <bitfield caption="Power Reduction Timer/Counter0" mask="0x20" name="PRTIM0"/>
                    <bitfield caption="Power Reduction PGA" mask="0x10" name="PRPGA"/>
                    <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
                    <bitfield caption="Power Reduction Serial Peripheral Interface" mask="0x04" name="PRSPI"/>
                    <bitfield caption="Power Reduction USART" mask="0x02" name="PRUSART0"/>
                    <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
                </register>
            </register-group>
            <value-group caption="" name="OSCCAL_BITF">
                <value caption="Calibration value for lowest oscillator frequency" name="VAL_0x00" value="0x00"/>
                <value caption="End value of low frequency range calibration" name="VAL_0x7f" value="0x7f"/>
                <value caption="Start value of high frequency range calibration" name="VAL_0x80" value="0x80"/>
                <value caption="Calibration value for highest oscillator frequency" name="VAL_0xff" value="0xff"/>
            </value-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL_MEGARF">
                <value caption="Division factor 1   / RC-Oscillator   2" name="VAL_0x0" value="0x0"/>
                <value caption="Division factor 2   / RC-Oscillator   4" name="VAL_0x1" value="0x1"/>
                <value caption="Division factor 4   / RC-Oscillator   8" name="VAL_0x2" value="0x2"/>
                <value caption="Division factor 8   / RC-Oscillator  16" name="VAL_0x3" value="0x3"/>
                <value caption="Division factor 16  / RC-Oscillator  32" name="VAL_0x4" value="0x4"/>
                <value caption="Division factor 32  / RC-Oscillator  64" name="VAL_0x5" value="0x5"/>
                <value caption="Division factor 64  / RC-Oscillator 128" name="VAL_0x6" value="0x6"/>
                <value caption="Division factor 128 / RC-Oscillator 256" name="VAL_0x7" value="0x7"/>
                <value caption="Division factor 256 / RC-Oscillator 512" name="VAL_0x8" value="0x8"/>
                <value caption="Reserved" name="VAL_0x9" value="0x9"/>
                <value caption="Reserved" name="VAL_0xA" value="0xA"/>
                <value caption="Reserved" name="VAL_0xB" value="0xB"/>
                <value caption="Reserved" name="VAL_0xC" value="0xC"/>
                <value caption="Reserved" name="VAL_0xD" value="0xD"/>
                <value caption="Reserved" name="VAL_0xE" value="0xE"/>
                <value caption="Division factor 1 only permitted for RC-Oscillator. Flash and EEPROM programming is not allowed."
                       name="VAL_0xF" value="0xF"/>
            </value-group>
            <value-group caption="" name="CPU_SLEEP_MODE_3BITS">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Power Save" name="PSAVE" value="0x03"/>
                <value caption="Reserved" name="VAL_0x04" value="0x04"/>
                <value caption="Reserved" name="VAL_0x05" value="0x05"/>
                <value caption="Standby" name="STDBY" value="0x06"/>
                <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
            </value-group>
