bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA256RFR2.xml
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="Pull-up Disable" mask="0x10" name="PUD"/>
                </register>
            </register-group>
            <value-group caption="" name="LLDRL_VALUE_BITF">
                <value caption="Calibration limit for fast process corner/high output voltage" name="VAL_0x00"
                       value="0x00"/>
                <value caption="Calibration limit for slow process corner/low output voltage" name="VAL_0x08"
                       value="0x08"/>
            </value-group>
            <value-group caption="" name="LLDRH_VALUE_BITF">
                <value caption="Calibration limit for fast process corner/high output voltage" name="VAL_0x00"
                       value="0x00"/>
                <value caption="Calibration limit for slow process corner/low output voltage" name="VAL_0x10"
                       value="0x10"/>
            </value-group>
            <value-group caption="" name="PAD_IO_bitf">
                <value caption="2 mA" name="PAD_IO_2MA" value="0"/>
                <value caption="4 mA" name="PAD_IO_4MA" value="1"/>
                <value caption="6 mA" name="PAD_IO_6MA" value="2"/>
                <value caption="8 mA" name="PAD_IO_8MA" value="3"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="QFN64">
            <pin pad="PF2" position="1"/>
            <pin pad="PF3" position="2"/>
            <pin pad="PF4" position="3"/>
            <pin pad="PF5" position="4"/>
            <pin pad="PF6" position="5"/>
            <pin pad="PF7" position="6"/>
            <pin pad="AVSS_RFP" position="7"/>
            <pin pad="RFP" position="8"/>
            <pin pad="RFN" position="9"/>
            <pin pad="AVSS_RFN" position="10"/>
            <pin pad="TST" position="11"/>
            <pin pad="RSTN" position="12"/>
            <pin pad="RSTON" position="13"/>
            <pin pad="PG0" position="14"/>
            <pin pad="PG1" position="15"/>
            <pin pad="PG2" position="16"/>
            <pin pad="PG3" position="17"/>
            <pin pad="PG4" position="18"/>
            <pin pad="PG5" position="19"/>
            <pin pad="DVSS" position="20"/>
            <pin pad="DVDD" position="21"/>
            <pin pad="DVDD" position="22"/>
            <pin pad="DEVDD" position="23"/>
            <pin pad="DVSS" position="24"/>
            <pin pad="PD0" position="25"/>
            <pin pad="PD1" position="26"/>
            <pin pad="PD2" position="27"/>
            <pin pad="PD3" position="28"/>
            <pin pad="PD4" position="29"/>
            <pin pad="PD5" position="30"/>
            <pin pad="PD6" position="31"/>
            <pin pad="PD7" position="32"/>
            <pin pad="CLKI" position="33"/>
            <pin pad="DEVDD" position="34"/>
            <pin pad="DVSS" position="35"/>
            <pin pad="PB0" position="36"/>
            <pin pad="PB1" position="37"/>
            <pin pad="PB2" position="38"/>
            <pin pad="PB3" position="39"/>
            <pin pad="PB4" position="40"/>
            <pin pad="PB5" position="41"/>
            <pin pad="PB6" position="42"/>
            <pin pad="PE7" position="43"/>
            <pin pad="DEVDD" position="44"/>
            <pin pad="DVSS" position="45"/>
            <pin pad="PE0" position="46"/>
            <pin pad="PE1" position="47"/>
            <pin pad="PE2" position="48"/>
            <pin pad="PE3" position="49"/>
            <pin pad="PE4" position="50"/>
            <pin pad="PE5" position="51"/>
            <pin pad="PE6" position="52"/>
            <pin pad="PE7" position="53"/>
            <pin pad="DEVDD" position="54"/>
            <pin pad="DVSS" position="55"/>
            <pin pad="XTAL2" position="56"/>
            <pin pad="XTAL1" position="57"/>
            <pin pad="AVSS" position="58"/>
            <pin pad="EVDD" position="59"/>
            <pin pad="AVDD" position="60"/>
            <pin pad="AVSS" position="61"/>
            <pin pad="AREF" position="62"/>
            <pin pad="PF0" position="63"/>
            <pin pad="PF1" position="64"/>
        </pinout>
    </pinouts>
</target-description-file>
